#**Formas de importação de dados com Pandas**
Tipos de arquivos:
*   csv
*   xlsx
*   json

In [1]:
#Importação da biblioteca pandas
import pandas as pd #essa é a forma de importação padrão da biblioteca

#**Importando CSV**

In [3]:
#importando um arquivo localmente, ou seja, o arquivo está no mesmo diretório aonde está o arquivo ipynb
df = pd.read_csv('fVendas.csv')
df.head() #Mostra as 5 primeiras linhas do dataframe

   Data Venda  ID_Produto          Cidade  Produto    Valor  ID_Vendedor
0       41279           3  Rio de Janeiro        3   3490.0            6
1       41280           1  Rio de Janeiro        6     54.0            8
2       41280           4    Duque Caxias        1    100.0            7
3       41280           2           Angra        9  14170.0            7
4       41280           4    Duque Caxias        7    100.0            6

In [12]:
#importando um arquivo quando não está no local
df = pd.read_csv('/content/fVendas.csv', sep=',', header=0, nrows= 2  ) # O local é passado em com o caminho inicial e separado por '/' até chegar no arquivo final
                                                  # sep -> Significa o separador que será usado para definir as colunas
                                                  # header -> Indica qual linha está o cabeçalho de dados
                                                  # nrows -> Número de linhas a ser lido no arquivo

df.head() #Mostra as 5 primeiras linhas do dataframe

   Data Venda  ID_Produto          Cidade  Produto  Valor  ID_Vendedor
0       41279           3  Rio de Janeiro        3   3490            6
1       41280           1  Rio de Janeiro        6     54            8

###**Há muitos outros atributos, esses são alguns exemplos que podem te ajudar no dia a dia**
[Link da documentação](https://pandas.pydata.org/docs/reference/api/pandas.read_csv.html)

#**Importando XLSX**

In [18]:
#importando um arquivo usando a função xlsx
df = pd.read_excel('fVendas.xlsx', index_col=0 ,dtype={'ID_Produto': float},
                   na_values=['Vazio'])                                      # index_col -> Define qual coluna será usada como index
                                                                             # dtype -> Define o tipo de dado de uma ou mais colunas
                                                                             # na_values -> Caso tenha um valor vazio ele muda para Vazio
df.head() #Mostra as 5 primeiras linhas do dataframe

            ID_Produto          Cidade  Produto    Valor  ID_Vendedor
Data Venda
2013-01-05         3.0  Rio de Janeiro        7   3490.0            3
2013-01-06         2.0  Rio de Janeiro        7     54.0            2
2013-01-06         1.0    Duque Caxias        8    100.0            1
2013-01-06         3.0           Angra        2  14170.0            3
2013-01-06         3.0    Duque Caxias        8    100.0            3

In [20]:
#importando um arquivo usando a função xlsx
df = pd.read_excel('fVendas.xlsx', index_col=0 ,dtype={'ID_Produto': float},
                   na_values=['Vazio'], sheet_name='fvendas')                # index_col -> Define qual coluna será usada como index
                                                                             # dtype -> Define o tipo de dado de uma ou mais colunas
                                                                             # na_values -> Caso tenha um valor vazio ele muda para Vazio
                                                                             # sheet_name -> Define a aba da planilha que vai ser importada (Observe a voluna ID_Vendedor)

df.head() #Mostra as 5 primeiras linhas do dataframe

            ID_Produto          Cidade  Produto    Valor  ID_Vendedor
Data Venda
41279              3.0  Rio de Janeiro        6   3490.0            7
41280              1.0  Rio de Janeiro        2     54.0            8
41280              3.0    Duque Caxias        2    100.0            6
41280              2.0           Angra        9  14170.0            7
41280              2.0    Duque Caxias        4    100.0            8

[Documentação Excel](https://pandas.pydata.org/docs/reference/api/pandas.read_excel.html)

#**Importando Json**

[link do dataset usado no código abaixo](https://data.world/dr5hn/country-state-city/workspace/file?filename=cities.json)

In [23]:
# Importando um arquivo json
df = pd.read_json('cities.json') # Geralmente o arquivo json é padrão, porém há muitos atributos dentro desse método read_json
df.head()

    id       name  state_id  ...  latitude  longitude wikiDataId
0   52  Ashkāsham      3901  ...  36.68333   71.53333   Q4805192
1   68   Fayzabad      3901  ...  37.11664   70.58002    Q156558
2   78       Jurm      3901  ...  36.86477   70.83421  Q10308323
3   84    Khandūd      3901  ...  36.95127   72.31800   Q3290334
4  115  Rāghistān      3901  ...  37.66079   70.67346   Q2670909

[5 rows x 9 columns]

[Documentação json](https://pandas.pydata.org/docs/reference/api/pandas.io.json.read_json.html)